<!-- placeholder-1 -->
```fish
tofu plan -chdir=opentofu
```
<!-- placeholder-2 -->

<details><summary>Diff of 1 change.</summary>

```diff
! google_cloud_run_v2_service.cloud_run_service is tainted, so it must be replaced
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @aduuna at 2025-03-26T10:15:56Z [(view log)](https://github.com/Ishangoai/linkedin_genai/actions/runs/14080782337/job/39520798478#step:4:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # google_cloud_run_v2_service.cloud_run_service is tainted, so it must be replaced
-/+ resource "google_cloud_run_v2_service" "cloud_run_service" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-03-27T14:00:37.866939Z"
              - message              = "Revision 'ishango-genai-writer-service-00001-lv7' is not ready and cannot serve traffic. Image 'europe-west2-docker.pkg.dev/ishango-genai-writer/ishango-genai-writer-gcr/ishango-genai-writer-image:latest' not found."
              - reason               = "REVISION_FAILED"
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
            },
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-03-27T14:00:37.847936Z"
              - message              = "Image 'europe-west2-docker.pkg.dev/ishango-genai-writer/ishango-genai-writer-gcr/ishango-genai-writer-image:latest' not found."
              - reason               = ""
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
            },
        ] -> (known after apply)
      ~ create_time             = "2025-03-27T14:00:37.621226Z" -> (known after apply)
      ~ creator                 = "tf-provision@ishango-genai-writer.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"CIW0lb8GEJDQnKgC/cHJvamVjdHMvaXNoYW5nby1nZW5haS13cml0ZXIvbG9jYXRpb25zL2V1cm9wZS13ZXN0Mi9zZXJ2aWNlcy9pc2hhbmdvLWdlbmFpLXdyaXRlci1zZXJ2aWNl\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/ishango-genai-writer/locations/europe-west2/services/ishango-genai-writer-service" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "tf-provision@ishango-genai-writer.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/ishango-genai-writer/locations/europe-west2/services/ishango-genai-writer-service/revisions/ishango-genai-writer-service-00001-lv7" -> (known after apply)
      + latest_ready_revision   = (known after apply)
        name                    = "ishango-genai-writer-service"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - execution_reason     = ""
              - last_transition_time = "2025-03-27T14:00:37.866939Z"
              - message              = "Revision 'ishango-genai-writer-service-00001-lv7' is not ready and cannot serve traffic. Image 'europe-west2-docker.pkg.dev/ishango-genai-writer/ishango-genai-writer-gcr/ishango-genai-writer-image:latest' not found."
              - reason               = "REVISION_FAILED"
              - revision_reason      = ""
              - severity             = ""
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "9a57b906-43bc-4ade-be8c-d10261d335e1" -> (known after apply)
      ~ update_time             = "2025-03-27T14:00:37.621226Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://ishango-genai-writer-service-257550582362.europe-west2.run.app",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ template {
          - annotations                      = {} -> null
          - labels                           = {} -> null
          - session_affinity                 = false -> null
            # (3 unchanged attributes hidden)

          ~ containers {
              - args       = [] -> null
              ~ build_info = [] -> (known after apply)
              - command    = [] -> null
              - depends_on = [] -> null
                name       = "ishango-genai-writer-image-1"
                # (1 unchanged attribute hidden)

                # (5 unchanged blocks hidden)
            }

          ~ scaling {
              - min_instance_count = 0 -> null
                # (1 unchanged attribute hidden)
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-32-3c30ffc64593dbbd3a259c15cca3364d.tfplan -->
<!-- placeholder-6 -->